app/controllers/bourbons_controller.rb

SELECT "bourbons".* FROM "bourbons"
---
  def index
    bourbons = Bourbon.all

INSERT INTO "bourbons" ("name", "distillery", "flavornotes", "pairing", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "test"], ["distillery", ""], ["flavornotes", ""], ["pairing", ""], ["created_at", "2020-08-12 14:59:34.889339"], ["updated_at", "2020-08-12 14:59:34.889339"]]
---
  def create
    @bourbon = Bourbon.new(bourbon_params)

    if @bourbon.save

DELETE FROM "bourbons" WHERE "bourbons"."id" = ?  [["id", 5]]
---
  def destroy
    @bourbon.destroy

SELECT "bourbons".* FROM "bourbons" WHERE "bourbons"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_bourbon
      @bourbon = Bourbon.find(params[:id])