app/controllers/categories_controller.rb

  def create
    binding.pry
    @category = Category.new(category_params)

    if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "test"], ["created_at", "2020-08-14 01:54:21.717310"], ["updated_at", "2020-08-14 01:54:21.717310"]]